---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MirrorFailures.BadMirror
source: html/29330bab-bca9-b16e-5a08-2a489ed642ff.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MirrorFailures.BadMirror Property

Can't mirror element into this position.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadMirror { get; }
```